const assetList = [
  {
    assetName: "T梁",
    assetId: "86.122.2 SX-XYGS-009-26-QL-010-SBGC-008-TL-002-ZL1",
    epc: "202212200043",
    imageCount: 10,
    desc: "一、	工程概况东寨特大桥上部结构采用30m、40m装配式预应力T梁，全桥左幅共17联、47跨，桥梁左幅全长1635.7m，左幅中心桩号K29+585.85，全桥右幅共16联、47跨，桥梁右幅全长1636m，右幅中心桩号K29+586。\n二、预制信息东寨特大桥右幅9-1边跨边梁\n三、设计要求\n梁长: 39.524m，梁高: 2.5m\n梁底宽: 60cm，梁顶宽: 1.95m，翼板厚度: 20cm\n四、工序时间\n预制时间: 2022年10月14日\n\n工业互联网标识码：86.122.2 SX-XYGS-009-26-QL-010-SBGC-008-TL-002-ZL3\n由国家工信部授权工业互联网标识解析二级节点（太原）签发",
  },
  {
    assetName: "桥墩",
    assetId: "86.122.2 SX-XYGS-009-26-QL-010-SBGC-008-TL-002-ZL2",
    epc: "202212200044",
    imageCount: 5,
    desc: "1.钢波纹管技术参数\n波形参数:跨径20-80m时,波距及波高150*50mm、200*55mm;跨径3.0-60m时,波距及波高15050mm、200*55mm、400*150mm;标准跨径:2m3m4m5m6m7m8m9m10m11m12m13m14m15m16m(采用片状拼装,板片间搭接螺栓连接而成)\n2.施工要点: 管道按要求铺设完毕后，周边及时回填砂( 顶部约 500 mm厚) 且分层夯实，管子与检查井连接处尽可能回填，外露越少越好; 有地下水时检查井与管子连接完毕后，在检查井与管子连 接外侧浇混凝土或砖保护体；检查井砌筑时，一定要确保砂浆饱满度大于 80% ，砂浆搅拌一定要按配合比执行，内外抹灰时先 安装盖板；尽可能在检查井周边设置三七灰土； 地埋排污管连接方式有: a． 电热熔焊;  b． 热熔挤出焊接。\n\n工业互联网标识码：86.122.2 SX-XYGS-009-26-QL-010-SBGC-008-TL-002-ZL3\n由国家工信部授权工业互联网标识解析二级节点（太原）签发",
  },
  {
    assetName: "钢波纹管",
    assetId: "86.122.2 SX-XYGS-009-26-QL-010-SBGC-008-TL-002-ZL3",
    epc: "202212200045",
    imageCount: 2,
    desc: "工业互联网标识码：86.122.2 SX-XYGS-009-26-QL-010-SBGC-008-TL-002-ZL3\n由国家工信部授权工业互联网标识解析二级节点（太原）签发",
  },
];

assetList.forEach((item) => {
  const images = [];
  const { imageCount, epc } = item;
  for (let i = 0; i < imageCount; i++) {
    const img = "require(`./images/${epc} (${i + 1}).png`)";
    images.push(img);
  }
  item["images"] = images;
});

export default assetList;
